
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти



#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//1. Нижняя граница первого диапазона должна быть равна 0.
	//2. Верхняя граница каждого диапазона, кроме последнего, должна быть равна нижней следующего.
	//3. Верхняя граница всегда больше нижней (кроме последнего диапазона).
	//4. Верхняя граница последнего диапазона должна быть равна 0.
	
	Если Диапазон.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ВерняяГраницаПредыдущегоДиапазона = 0;

	Если Диапазон[0].НижняяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нижняя граница диапазона должна быть равна 0.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Диапазон[0].НижняяГраница";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Для Сч = 0 По Диапазон.Количество() - 1 Цикл

		Диапазоны = Диапазон[Сч];
		Если Сч > 0 Тогда
			Если Диапазоны.НижняяГраница <> ВерняяГраницаПредыдущегоДиапазона Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Верхняя граница диапазона должна быть равна нижней границе следуюшего.";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Диапазон[%1].НижняяГраница", XMLСтрока(Сч));
				Сообщение.Сообщить();
			КонецЕсли;

		КонецЕсли;

		Если Диапазоны.НижняяГраница >= Диапазоны.ВерхняяГраница 
			И Сч <> Диапазон.Количество() - 1 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Верхняя граница диапазона должна всегда быть больше нижней границы.";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = СтрШаблон("Диапазон[%1].ВерхняяГраница", XMLСтрока(Сч));
			Сообщение.Сообщить();
		КонецЕсли;
		
		ВерняяГраницаПредыдущегоДиапазона = Диапазоны.ВерхняяГраница;

	КонецЦикла;
	
	ПоследнийДиапазон = Диапазон[Диапазон.Количество() - 1];
	
	Если ПоследнийДиапазон.ВерхняяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нижняя граница диапазона должна быть равна 0.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = СтрШаблон("Диапазон[%1].ВерхняяГраница", XMLСтрока(Диапазон.Количество() - 1));
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр АктуальнаяШкалаБонуснойПрограммы
	Движения.АктуальнаяШкалаБонуснойПрограммы.Записывать = Истина;
	Движение = Движения.АктуальнаяШкалаБонуснойПрограммы.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;
КонецПроцедуры

#КонецОбласти




#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
